In [1]:
import pandas as pd

In [2]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [3]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

Write a solution to find managers with at least five direct reports.

Return the result table in any order.

The result format is in the following example.

| name |
|------|
| John |

In [6]:
managers=employee.groupby(by="managerId").size().reset_index(name="count")
managers=managers.loc[(managers["count"]>=5)]
managers

   managerId  count
0        101      5

In [8]:
employee.loc[(employee["id"].isin(managers["managerId"]))][["name"]]

   name
0  John